{"class_name": "Model", "config": {"name": "model_2", "layers": [{"name": "indexed-feat", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1537], "dtype": "float32", "sparse": false, "name": "indexed-feat"}, "inbound_nodes": []}, {"name": "lambda_1", "class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0004\u0000\u0000\u0000S\u0000\u0000\u0000s\u0014\u0000\u0000\u0000|\u0000d\u0000d\u0000\u0085\u0002d\u0000d\u0002\u0085\u0002f\u0002\u0019\u0000S\u0000)\u0003N\u00e9\u0001\u0000\u0000\u0000\u00e9\u00ff\u00ff\u00ff\u00ff\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa//home/kog1cob/Dheeraj/EigenPro2-master/utils.py\u00da\b<lambda>D\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["indexed-feat", 0, 0, {}]]]}, {"name": "kernel_embedding_2", "class_name": "KernelEmbedding", "config": {"name": "kernel_embedding_2", "trainable": true, "batch_input_shape": [null, 1536], "dtype": "float32"}, "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "batch_input_shape": [null, 10000], "dtype": "float32", "units": 8, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["kernel_embedding_2", 0, 0, {}]]]}], "input_layers": [["indexed-feat", 0, 0]], "output_layers": [["dense_1", 0, 0]]}, "keras_version": "2.0.8", "backend": "tensorflow"}